Revit 2024 API
ElectricalSystem.CircuitNamingIndex Property
 The Circuit Naming Index where the Electrical System is located in its panel. The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public int CircuitNamingIndex { get; }
Visual Basic
Public ReadOnly Property CircuitNamingIndex As Integer
	Get
Visual C++
public:
property int CircuitNamingIndex {
	int get ();
}
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace